Repository: PureBasicCN/PureBasicPreference
Catalog: OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The process of computer driven hardware prototype creation is simplified when the serial port is used.
zh_cn: 使用串行端口时，将简化计算机驱动硬件设备的过程。

source: The radius of the circle.
zh_cn: 圆的半径。

source: The result can be a combination (with bitwise or) of the following flags:
zh_cn: 结果可以是组合 （与按位或） 以下标志：

source: The result is always between 0 and 23.
zh_cn: 结果总是在 0 到 23 之间.

source: The result is always between 0 and 59.
zh_cn: 结果总是 0 到 59 之间.

source: The result is always between 1 and 12.
zh_cn: 结果总是 1 到 12 之间.

source: The result is always between 1 and 31.
zh_cn: 结果总是 1 到 31 之间（一个月最多只有31天）.

source: The result will be between 0 and 255.
zh_cn: 结果在0至255之间。

source: The rules for the indentation can be specified in the preferences.
zh_cn: 缩进规则可以在 配置 preferences中进行设置。

source: The search can be continued after a match is found with the Find Next menu command (F3 by default).
zh_cn: 找到一个匹配内容后，可以继续按“查找下一个”菜单命令（默认F3），接着进行搜索。

source: The serial port to close.
zh_cn: 需要关闭的串口.

source: The serial port to test.
zh_cn: 要测试的串口。

source: The serial port to use.
zh_cn: 要使用的串口。

source: The settings made there are associated with the current source file or the current project, and also remembered when they are closed.
zh_cn: 在这里所做的设置会与当前的源文件或项目关联，并且保存源码或工程时，设置信息同样也会被保存。

source: The shortcut Ctrl+M (CMD+M on OSX) can be used to select the block of code that contains caret position (i.e. the surrounding If block, loop or procedure).
zh_cn: 快捷键 Ctrl + M (在 OSX系统中为 CMD + M ) 可以用于快速选择包含插入符号位置的代码块 (如：If 块、 循环或过程等)。

source: The shortcut Ctrl+Shift+M (CMD+Shift+M on OSX) reverses the behavior and reverts the selection to the block that was selected before the last usage of the Ctrl+M shortcut.
zh_cn: 快捷键 Ctrl + Shift + M，(在 OSX 上为：CMD + Shift + M) 撤销选择动作，恢复到在最后一次使用 Ctrl + M 快捷键前的块选择。

source: The size with which the image will be drawn.
zh_cn: 将要绘制图像的大小.

source: The source code need not be saved for this (but any included files must be saved).
zh_cn: 这里源代码不需要保存（但是任何包含文件必须保存）。

source: The source code will be stored without encryption, so if you are working on sensitive source code, be sure to have this database file in a secure location, or disable this feature.
zh_cn: 源代码不加密存储，所以，如果你工作用到的的是比较敏感的源代码，请把数据库放在一个安全的位置，或者禁用此功能。

source: The specified buffer should be large enough to handle it.
zh_cn: 指定的缓冲区应该大到足以处理它。

source: The standard PureBasic file extensions (pb, pbi and pbf) are recognized as code files.
zh_cn: 标准的 PureBasic 文件扩展名 （pb、 pbi 和 pbf） 是认定代码文件。

source: The string format to use.
zh_cn: 字符串格式.

source: The string to send.
zh_cn: 要发送的字符串。

source: The string to write.
zh_cn: 要写入的字符串.

source: The string with the date to be parsed.
zh_cn: 要解析的日期字符串.

source: The syntax is simple but the possibilities are endless with PureBasic's advanced features, such as pointers, structures, procedures, dynamically linked lists and much more.
zh_cn: 语法很简单，但具有无限可能的PureBasic的高级功能，如指针，结构，程序，动态链接列表等等。

source: The title for the new console window.
zh_cn: 新的控制台窗口的标题。

source: The title of the newly created window.
zh_cn: 新创建的窗口的标题。

source: The toolbar simply provides shortcuts to menu features.
zh_cn: 工具栏只是提供菜单功能的快捷方式。

source: The tools displayed here can be configured, and it can even be completely removed.
zh_cn: 此处显示的工具可以被配置，并且它甚至可以完全移除。

source: The updates are unlimited, unlike most other software out there.
zh_cn: 这些更新是没有限制的的，不像其他大多数软件不是这样。

source: The use of this is that when you are editing a file that does not run by itself, but is included into another file, you can tell the compiler to use that other file to start the compilation.
zh_cn: 当您正在编辑一个文件，但它本身并不运行，而是包含included到另一个文件中，你可以使用此选项告诉编译器对其他文件进行编译运行。

source: The used shortcut can be configured in the preferences.
zh_cn: 使用的快捷键可以在preferences中配置。

source: The used shortcuts can be configured in the preferences.
zh_cn: 使用的快捷键可以在preferences中配置。

source: The value to add to the date.
zh_cn: 添加到日期的值.

source: The value type.
zh_cn: 添加值的类型.

source: The vertical position in the console to move to (starting from 0)
zh_cn: 控制太重的垂直位置（从0开始）。

source: The window to use.
zh_cn: 要使用的窗口.

source: The x and y coordinate received in the callback are always relative to the upper left corner of the drawing output.
zh_cn: 和y在回调坐标接收的X总是相对于绘图输出的左上角.

source: There are also options for compiling PureBasic projects directly from the command-line.
zh_cn: 也可以通过命令行选项直接编译PureBasic项目.

source: There are no bottlenecks like a virtual machine or a code translator: the generated code produces highly optimized executables regardless of the OS on which it is compiled.
zh_cn: 这样就没有类似虚拟机或者代码解释器之类的性能瓶颈，生成的代码都针对这个操作系统编译的高度优化后的可执行文件。

source: There is an undo buffer, so several actions can be undone.
zh_cn: 由于自带一个撤销缓冲区，所以可以进行多次撤销动作而不单单只能撤消一次。

source: There is either no room in the input buffer
zh_cn: 输入缓冲区中没有足够的空间

source: There presence is indicated by a little arrow next to the line numbers.
zh_cn: 在行号旁边出现一个小箭头的标记。

source: Therefore if this value needs to be used more than once, the data has to be stored in a variable, since all subsequent calls will return the wrong value.
zh_cn: 因此如果需要超过一次使用此值，数据必须存储在变量中，因为所有的后续调用将返回错误值。

source: These features are completely optional.
zh_cn: 这些功能是完全可选的。

source: These functions are useful to perform Drawing operations.
zh_cn: 这些函数对于执行绘图操作非常有用。

source: These programs are not real MS-DOS programs!
zh_cn: 这些程序不是真正的MS-DOS程序！

source: These programs must be executed only from the Windows function prompt.
zh_cn: 这些程序必须只能从Windows的命令行下执行。

source: These will be displayed in the internal File Viewer.
zh_cn: 这些将在内部文件查看器中显示。

source: This allows the implementation of custom drawing effects while still using the default functions to do the actual drawing.
zh_cn: 这允许执行自定义绘制效果同时仍然使用默认功能做实际的绘图。

source: This allows you to create several shortcuts that start the IDE with different configurations for different users, or for different projects.
zh_cn: 这样可以允许您创建多个快捷方式，针对不同的用户，或者不同的项目进行差异化配置启动IDE。

source: This also works for procedures, prototypes, interfaces or imported functions in your code as long as they are declared in the same source code or project.
zh_cn: 这个特性，也适用于 procedures 过程, prototypes 原型, interfaces 接口或 imported 引用函数 ，只要他们在相同的源代码或 project 工程中已经声明。

source: This behavior can be changed in the Preferences.
zh_cn: 此处可以在配置首选项中更改。

source: This callback will be called many times (for every pixel to draw) so it should be very small and fast to not have a too big impact on the drawing performance.
zh_cn: 此回调将被调用多次 （用于绘制每个像素） 所以它应该是很小，速度快，对绘图的性能没有太大的影响。

source: This can be a 24-bit RGB or a 32-bit RGBA value.
zh_cn: 可以是一个24位RGB或32位的RGBA值。

source: This causes the compiler to restart.
zh_cn: 这使编译器重新启动。

source: This chapter covers only a small part of the 1500+ commands available in PureBasic!
zh_cn: 本章只包括PureBasic超过1500 + 可用命令中的一小部分！

source: This color can be in RGB or RGBA format.
zh_cn: 这个颜色可以是 RGB 或 RGBA 格式.

source: This command is only valid after a successful FirstDatabaseRow(), PreviousDatabaseRow() or NextDatabaseRow().
zh_cn: 此命令只有在FirstDatabaseRow()、 PreviousDatabaseRow()或NextDatabaseRow()等函数调用成功后才有效。

source: This command only has an effect on drawing outputs created by ImageOutput() or CanvasOutput().
zh_cn: 该命令只对通过 ImageOutput() or CanvasOutput()来创建绘图输出的作用.

source: This compiles the current source code with the compiler options set for it and executes it.
zh_cn: 编译器会按照设置的编译选项对当前的源代码进行编译并执行它。

source: This continues the search for the next match of the last search started by the Find/Replace dialog.
zh_cn: 继续“查找/替换”命令中最后一次搜索位置开始进行查找搜索。

source: This discards any changes not yet saved.
zh_cn: 这将放弃所做的任何更改。

source: This executes the last compiled source code once again.
zh_cn: 这再次执行最后一次编译的源代码。

source: This function allows you to change the height of the cursor.
zh_cn: 此函数允许您更改光标的高度。

source: This function has to be called again if other drawing commands of this library where used since the last pixel manipulation.
zh_cn: 如果此库的其他绘图命令之前使用了像素操作，那么此函数可以再次调用。

source: This function has to be called before OpenScreen() to have any effect.
zh_cn: 此函数在调用 OpenScreen() 之后调用才会有效果.

source: This function is bulletproof and may be used with any value.
zh_cn: 此函数是保险性的，可能与任何值一起使用。

source: This function is for advanced programmers only.
zh_cn: 此函数仅限高级程序员使用。

source: This function is useful when another library needs a database reference.
zh_cn: 当另一个库需要数据库引用时，此功能非常有用。

source: This function is useful when another library or API commands requires a serial port reference.
zh_cn: 当另一个库或 API 命令需要一个串行端口的引用时，此功能非常有用。

source: This function is useful when you have added a new User Library to the PB directory, but do not want to restart the whole IDE.
zh_cn: 当你在PB目录中添加了一个新的用户库，但不希望重新启动整个IDE这个功能非常有用。

source: This function must be called before any other function of this library.
zh_cn: 该函数必须在这个库中的任何其他函数之前被调用。

source: This helps in aligning comments at the end of code lines to make the code more readable.
zh_cn: 在代码行末尾对注释进行对齐，有助于使代码更具可读性。

source: This increases the indentation of the whole selected block.
zh_cn: 这增加了整个选定块的缩进。

source: This is annoying because the compiler will complain 'Procedure <name> not found'.
zh_cn: 这是令人讨厌的因为编译器会抱怨“Procedure<name>无法找到”。

source: This is really useful only together with the "Replace All" button, in which case it will replace any found match, but only inside the selected region.
zh_cn: 这确实很有用，如果和“全部替换”按钮相配合，在这种情况下，它只会在选择的区域内替换匹配内容。

source: This is the correct way to ensure a serial port is ready to use.
zh_cn: 这是确保串口可用的正确方式。

source: This is the default drawing mode when the drawing starts.
zh_cn: 当绘图开始时使用默认的绘图模式。

source: This is the same as "Compile/Run" except that it ignores the debugger setting and enabled the debugger for this compilation.
zh_cn: 和“编译/运行”菜单相同对程序进行编译，但忽略调试器设置而是直接启用编译调试器。

source: This is used to create small programs that don't require a user interface or be executed from the function line.
zh_cn: 往往被用来创建小程序，或者不需要用户界面的程序，或者只是从函数线执行（比如调试程序时）。

source: This is useful to rollback to a previous version of a file, or to find back a deleted or corrupted file.
zh_cn: 对于回滚到以前的版本的文件或找回被删除或损坏的文件非常有用。

source: This is useful when you usually have the debugger off, but want to have it on for just this one compilation.
zh_cn: 当启用调试器开关关闭，但你又想对程序进行调试编译时，用此菜单项是很有用的。

source: This lets you jump to a specific line in your source code.
zh_cn: 允许你将光标跳转到指定的代码行。

source: This library allow the programmer to create console mode applications.
zh_cn: 这个库允许程序员创建控制台模式的应用程序。

source: This library offers full access to the serial ports available on the computer.
zh_cn: 此类库提供完全访问计算机上可用的串行端口的权限。

source: This makes commenting large blocks of code easier than putting the ; before each line manually.
zh_cn: 这样做使得注释多行代码时比较容易，不用手动一行一行的进行注释。

source: This makes it easy to compile different versions of the same program (x86 and x64) without having to start up the IDE for the other compiler just for the compilation.
zh_cn: 这使得它易于编译的相同程序的不同版本（x86和x64）而无需重启IDE的编译器进行编译。

source: This makes it easy to see any more parameters you still have to add to this function.
zh_cn: 这使得你很容易查看到要输入功能函数的参数。

source: This makes the cursor jump to the next marker position further down the code from the current cursor position.
zh_cn: 该命令使光标从当前位置跳转到下一个书签标记位置代码行。

source: This means than when you buy PureBasic you will get all future updates for free, on this web site (it only applies if registered on this web site, not for boxed version of PureBasic).
zh_cn: 这意味着，当你购买的PureBasic你会得到免费的所有未来的更新都在官网上可以下载到。

source: This means that an executable compiled with the x86 compiler can be debugged using the x64 IDE and vice versa.
zh_cn: 这意味着，用x86编译器编译的可执行文件可以使用 x64 IDE进行调试，反之亦然。

source: This means that the same code can be compiled natively for all systems and still use the full power of each.
zh_cn: 这意味着，相同的代码可以在所有系统中本地编译并仍然能使用每个系统下的全部功能。

source: This message is also logged in the error log, and the line that caused the error is marked.
zh_cn: 此消息会被记录到错误日志中，导致出错的错误行也会被标记出来。

source: This mode cannot be combined with the below alpha channel modes.
zh_cn: 这种模式不能结合下列 alpha 通道模式。

source: This must be a 32-bit RGBA value.
zh_cn: 必须是一个32位RGBA值。

source: This of course closes the IDE.
zh_cn: 当然，这个是用来关闭 IDE的。

source: This only affects the display of the code in the IDE, not the code itself.
zh_cn: 只是影响代码在IDE中显示，并不会影响代码的完整性。

source: This opens a save dialog, asking for the executable name to create.
zh_cn: 这将打开一个保存对话框，要求输入文件名称来创建可执行文件。

source: This opens the compiler options dialog, that lets you set the options for the compilation of this source file.
zh_cn: 这将打开编译器选项对话框，让您设置这个源文件的编译选项。

source: This opens/closes all fold points in the current source.
zh_cn: 展开或收缩当前代码的所有折叠项。

source: This opens/closes the fold point in which the cursor is currently located.
zh_cn: 展开或收缩光标位置的折叠项。

source: This option allows the selection of a different compiler to use instead of the compiler of the current PureBasic version.
zh_cn: 此选项允许选择使用不同的编译器来代替当前purebasic的版本编译器。

source: This output can be read for example with the ReadProgramError() function of the Process library.
zh_cn: 此输出可以读取，比如在 Process 中使用 ReadProgramError()函数。

source: This prompts you for a new filename and leaves the old file (if any) untouched.
zh_cn: 你将需要为它命一个名。除此之外，源码将会被保存在上次保存的文件中。.

source: This radius does not include the center pixel.
zh_cn: 此半径不包括圆心像素。

source: This reverts the "Insert comments" command, but also works on comments manually set.
zh_cn: 这个功能可以恢复“插入注释”的代码行，同时也适用于手动设置的注释。

source: This same concept is applied to keywords.
zh_cn: 同样这个概念也应用于关键字。

source: This software has been developed for the Windows operating system.
zh_cn: 这个软件已经开发了用于Windows操作系统版本。

source: This value can be zero (for an invisible cursor) or range from 1 to 10 for the height of the cursor.
zh_cn: 光标高度值可以为0(针对隐藏鼠标)或者1至10之间。.

source: This way you have used variables "on the fly".
zh_cn: 这种使用变量的方式，“瞬间”你就会了。

source: Timo Harter
zh_cn: 小半砖头

source: Title$ (optional)
zh_cn: Title$ (可选)

source: To check how much data is available in the output buffer, use AvailableSerialPortOutput().
zh_cn: 要检测在输出缓冲区中有多少数据是可用的，请使用函数AvailableSerialPortOutput()。

source: To check if data is available, use AvailableSerialPortInput().
zh_cn: 若要检查数据是否可用，请使用AvailableSerialPortInput()。

source: To combine red, green and blue values in order to create a 24-bit RGB color, use the RGB() function.
zh_cn: 可以使用 RGB() 函数结合红绿蓝的顺序创建一个24位RGB颜色。

source: To combine red, green, blue and alpha values in order to create a 32-bit RGB color, use the RGBA() function.
zh_cn: 要结合红、绿、蓝和Alpha值的顺序创建一个32位颜色，那么轻使用 RGBA() 函数.

source: To configure the session history tool, see preferences.
zh_cn: 若要配置会话历史的工具，请参阅首选项。

source: To customize the compiling process, you can open the "Compiler options" dialog.
zh_cn: 若要设置编译方式，你可以打开“编译选项”对话框。

source: To determine the type of a column, DatabaseColumnType() can be used.
zh_cn: 若要确定列的类型，可以使用DatabaseColumnType() 。

source: To find out what each button does, move your mouse over it and wait until a small tool-tip appears.
zh_cn: 若要找出每个按钮的功能，将鼠标移动到它和等待，直到小工具提示出现。

source: To force the compiler always declaring variables before their first use, just use the keyword EnableExplicit.
zh_cn: 要强制编译器总是要求变量第一次使用前必须声明变量，只需使用关键字EnableExplicit。

source: To make all drawing relative to the upper left corner of the clipping box, a separate call to SetOrigin() must be made if this is desired.
zh_cn: 为了使所有的绘图相对的剪取框的左上角，如果需要的话必须单独调用SetOrigin()。

source: To restore the default system font, #PB_Default can be used as FontID.
zh_cn: 若要还原默认的系统字体，可以将 #PB_Default作为 FontID。

source: To use several modes at once, you have to use the '|' (OR) operator.
zh_cn: 要使用的几种方式你一次，必须使用 ' |'(OR) 运算符。

source: Tools Panel on the side:
zh_cn: 侧面工具面板：

source: Tools panel - Options
zh_cn: 工具栏- 选项

source: Topics in this chapter:
zh_cn: 本章主题：

source: Transforms a string date into a regular date value which then can be used by other date functions.
zh_cn: 将字符串日期转换为日期格式，然后其他日期函数可以使用它.

source: Under Windows, the console title is also the text shown in the start bar and in the task manager representing your console application.
zh_cn: 在Windows下，控制台的标题现在启动栏和任务管理器。

source: Undoes the last done action in the code editing area.
zh_cn: 取消在代码编辑区中的最后完成的动作。

source: Unit (optional)
zh_cn: 单位 (可选)

source: Use any of the supported credit cards by Paypal or PaySite Cash
zh_cn: 通过Paypal或PaySite现金使用任何支持的信用卡

source: UserGuide - First steps with the Debug output (variables & operators)
zh_cn: 用户指南 - 第一步 使用Debug调试输出 (变量 & 操作)

source: UserGuide - Overview
zh_cn: 用户指南 - 概述

source: UserGuide - Variables and Processing of variables
zh_cn: 用户指南 - 变量和变量处理

source: UserGuide Navigation
zh_cn: 用户指南导航

source: Various Topics
zh_cn: 各种主题

source: Very useful to for example hide all procedures in the code.
zh_cn: 这非常有用的，例如收缩代码中的所有折叠项。

source: WTTC stands for 'WriteTotalTimeoutConstant'.
zh_cn: WTTC 表示 'WriteTotalTimeoutConstant'，一次写入串口数据的固定超时。在一次写入串口的操作中，其超时为WriteTotalTimeoutMultiplier乘以写入的字节数再加上 WriteTotalTimeoutConstant。

source: WTTM stands for 'WriteTotalTimeoutMultiplier'.
zh_cn: WTTM 表示 'WriteTotalTimeoutMultiplier'，写入每字符间的超时。

source: We have put a lot of effort into its realization to produce a fast, reliable and system friendly language.
zh_cn: 我们投入大量的精力来研发快速、 可靠的系统友好语言及其实现。.

source: We have put a lot of effort into its realization to produce a fast, reliable system friendly language.
zh_cn: 我们有大量的精力投入，形成快速、 可靠的系统友好语言及其实现。

source: We now continue with a short example using the available variable types, arithmetic operators and displaying the result:
zh_cn: 继续一个简短的例子，使用可用的变量类型，算术运算符并显示结果:

source: We start programming... this part of the PureBasic manual should guide you through some basic stuff, which you should learn while starting to program with PureBasic.
zh_cn: 我们开始使用PureBasic编程前，通过手册指导可以让你对PureBasic有个基本的了解.

source: Webmaster :
zh_cn: 其他成员 :

source: When I buy PureBasic, will I get all the future updates for free ?
zh_cn: 当我购买了PureBasic，我可以免费获得所有更新？?

source: When a project is open, this menu entry compiles all targets that have this option enabled in the compiler options.
zh_cn: 当一个项目打开，这个菜单项会编译在编译器选项启用的所有目标。

source: When a project is open, this submenu shows all compile targets and allows to directly compile one of them.
zh_cn: 当一个项目打开，这个子菜单显示所有的编译目标，并允许直接编译其中之一。

source: When a project is open, this submenu shows all compile targets and allows to quickly switch the current default target.
zh_cn: 当一个项目打开时，这个子菜单就会显示所有编译目标，并允许快速切换当前默认目标。

source: When double-clicking on an IncludeFile or XincludeFile statement, the IDE will try to open that file.
zh_cn: 当鼠标双击引用文件 IncludeFile 或者 XincludeFile 时, 开发环境 IDE 将尝试打开该引用文件。

source: When double-clicking on the name of a procedure that is defined in the current source while holding down the Ctrl Key, the cursor automatically jumps to the declaration of this procedure.
zh_cn: 当按住 Ctrl 键的同时在当前源代码中定义的procedure 过程 名称上双击时，光标会自动跳到此 procedure 过程的声明处。

source: When saving plain text files, the IDE will not append its settings to the end of the file, even if this is configured for code files in the Preferences.
zh_cn: 保存纯文本的文件时，IDE 不会将其设置附加到文件的末尾，即使已经配置为首选项的代码文件。

source: When special folding keywords are encountered (Procedure / EndProcedure by default.
zh_cn: 当遇到指定的可折叠关键字时 (默认是 Procedure 过程 / EndProcedure 。

source: When starting the search, a separate window will be opened displaying the search results, giving the file, line number as well as the matched line of each result.
zh_cn: 当开始搜索时，将会显示一个搜索结果列表窗口，其中有文件名及匹配内容的行号。

source: When the Tab key is pressed while nothing or only a few characters are selected, the Tab key acts as mentioned above (inserting a number of spaces, or a real tab if configured that way).
zh_cn: 在无字符或者选择一些字符时，按下 Tab 键，将会发生指定动作 (根据制表符设置，当前行前面将会插入设定数量的空格符或者 tab 制表符)。

source: When the cursor is on an opening or closing brace the IDE will highlight the other brace that matches it.
zh_cn: 当光标位于左括号或右括号上时，IDE 将突出显示并自动匹配此括号。

source: When you press enter, the indentation (number of space/tab at the beginning of the line) of the current and next line will be automatically corrected depending on the keywords that exist on these lines.
zh_cn: 当您按下回车键时，当前行和下一行的缩进（行着的空格数或制表符Tab数）会根据存在于这些行上的 关键词而自动更正。

source: Whether or not a file is considered a code-file or not depends on the file extension.
zh_cn: 是否文件被认为是一个代码文件，或不取决于文件扩展名。

source: Whether or not the alpha channel is used depends on the drawing mode.
zh_cn: 是否使用alpha通道取决于 绘图模式.

source: Whether or not the debugger is enabled depends on the setting of the last compilation.
zh_cn: 是否启用调试器依赖于上次编译器的设置。

source: While typing, the IDE will show the needed parameters for any PureBasic function whose parameters you are currently typing.
zh_cn: 当输入代码时，开发环境 IDE 将会显示PureBasic 功能函数命令的原型和参数。

source: Why the Windows API description isn't included in the PureBasic documentation ?
zh_cn: 为什么 Windows API 说明不包含在 PureBasic 文档中 ?

source: Windows are essential components of modern interfaces.
zh_cn: Windows是现代界面必备的组件。

source: Windows: The icon must be in ICO format (Windows Icon).
zh_cn: Windows：图标必须是ICO格式（Windows 图标）

source: With EnableGraphicalConsole() the console can be switched between text and graphics mode.
zh_cn: 同EnableGraphicalConsole（）控制台可以将文本和图形模式之间切换。

source: With ImageOutput() this command allows direct access to the pixels of the target image.
zh_cn: ImageOutput()与此命令允许直接访问目标图像的像素。

source: With this menu option you can jump back to the previous position.
zh_cn: 通过此菜单选项，您可以跳回到以前历史的位置行。

source: Working with source files
zh_cn: 源码文件处理

source: Writes a string to the specified serial port.
zh_cn: 将一个字符串写入指定的串行端口.

source: Writes an arbitrary amount of data to the specified serial port.
zh_cn: 将任意数量的数据写入到指定的串行端口。

source: Writes the Message string (plus a newline) to the standard error output of the program.
zh_cn: 向程序的标准错误输出中写入一个字符串(具有换行符)。

source: Yann Vanlerberghe
zh_cn: 布鲁斯兰 知易

source: Yes.
zh_cn: 是.

source: You can also continue typing while the list is open.
zh_cn: 你也可以继续输入以减少列表选项达到更精确的内容。

source: You can also load binary files with the Open menu.
zh_cn: 您也可以加载二进制文件与打开的菜单。

source: You can also put the filenames of source files to load on the command-line.
zh_cn: 你也可以在命令行指定要加载的源文件文件名。

source: You can customize the searched files by specifying extension filters.
zh_cn: 您可以通过指定扩展名过滤器设定搜索的文件。

source: You can edit multiple source code files at the same time.
zh_cn: 您可以同时编辑多个源代码文件。

source: You can even specify wildcards for them (so with "*.pb" you can load a whole directory).
zh_cn: 你夜可以为他们指定通配符 (所有易用 "*.pb" 那你就可以加载整个目录).

source: You can later jump to these markers with the "Jump to marker" command.
zh_cn: 你可以使用 "跳转到标签" 命令来将光标跳转制书签处。

source: You can make the search more specific by enabling one of the checkboxes:
zh_cn: 您可以通过下列选项使搜索更加具体：

source: You can switch between them using the panel located under the Toolbar.
zh_cn: 您可以使用位于工具栏下方的面板切换它们。

source: You can switch between them with the tabs located right above it.
zh_cn: 您可以与位于正上方的选项卡之间进行切换。

source: You can then select one of these words with the up/down keys and insert it at the point you are by pressing the Tab key.
zh_cn: 然后你可以通过上下方向键（UP / DOWN键）进行选择，按Tab键自动完成插入。

source: You have to specify a search keyword, as well as a base directory ("root directory") in which to search.
zh_cn: 你必须指定一个搜索关键字，以及一个搜索目录（“根目录”）来进行搜索。

source: You want to see it?
zh_cn: 你想看看吗？

source: You will be asked to save any non-saved source codes.
zh_cn: 你会被询问是否保存任何未保存的源代码。

source: alphasnd@purebasic.com
zh_cn: 100860505@qq.com

source: andre@purebasic.com
zh_cn: tsliuhaitao@qq.com

source: based on established BASIC rules on spiderbasic.com
zh_cn: 基于BASIC准则 详情点击spiderbasic.cn

source: basic programming web language
zh_cn: BASIC编程网络语言

source: d / c ; we directly use the value of 'd' (= 12) divided by the value of 'c' (= 3) and save the result in 'd'
zh_cn: d / c ;我们直接使用“d”的值（= 12）除以“c”的值（= 3），并将结果（=4）保存到变量“d”
